*** Installing new version
    For example you want to have a fresh version of =go= language on your machine. You could do:
    #+BEGIN_SRC bash
    ./v go install 1.8.3
    #+END_SRC

    #+RESULTS:
    : Installed go version 1.8.3 into /home/user/.v/toolchain/go/1.8.3

    This will install =go 1.8.3= into =/home/user/.v/toolchain/go/1.8.3=.

    Next we need to apply the new go version envrionment to ours.

    Lets see what environment variables will be altered:
    #+BEGIN_SRC bash
    ./v go env 1.8.3
    #+END_SRC

    #+RESULTS:
    | export | GOROOT_BOOTSTRAP='/usr/lib/golang'                                                                                               |
    | export | GOROOT='/home/user/.v/toolchain/go/1.8.3/build'                                                                                  |
    | export | PATH='/home/user/.v/toolchain/go/1.8.3/bin:/home/user/Projects/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin' |

    Go toolchain alters only 3 varialbes:
    - GOROOT_BOOTSTRAP
    - GOROOT
    - PATH

    Now =eval= them:
    #+BEGIN_SRC bash
    eval `./v go env 1.8.3`
    go version
    env | grep '^\(GOR\|PATH\)'
    #+END_SRC

    #+RESULTS:
    | go                                                                                                                             | version | go1.8.3 | linux/amd64 |
    | GOROOT_BOOTSTRAP=/usr/lib/golang                                                                                               |         |         |             |
    | PATH=/home/user/.v/toolchain/go/1.8.3/bin:/home/user/Projects/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin |         |         |             |
    | GOROOT=/home/user/.v/toolchain/go/1.8.3/build                                                                                  |         |         |             |

    You could add toolchain environment evaluation into you =/etc/profile= or your dotfiles to make it permanent across sessions.
